zephyrproject-rtos/zephyr/drivers/spi/spi_esp32_spim.c
/*
 * Copyright (c) 2020-2025 Espressif Systems (Shanghai) Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT espressif_esp32_spi

/* Include esp-idf headers first to avoid redefining BIT() macro */
#include <hal/spi_hal.h>
#include <hal/spi_ll.h>
#include <esp_attr.h>
#include <esp_clk_tree.h>
#include <zephyr/cache.h>

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(esp32_spi, CONFIG_SPI_LOG_LEVEL);

#include <soc.h>
#include <esp_memory_utils.h>
#include <zephyr/drivers/spi.h>
#include "spi_rtio.h"
#include <zephyr/drivers/interrupt_controller/intc_esp32.h>
#ifdef SOC_GDMA_SUPPORTED
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_esp32.h>
#endif
#include <zephyr/drivers/clock_control.h>
#include <zephyr/pm/policy.h>
#include "spi_context.h"
#include "spi_esp32_spim.h"

#if CONFIG_ESP32_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP && SOC_SPI_SUPPORT_SLEEP_RETENTION
#define SPI_SLEEP_RETENTION_ENABLED 1
#else
#define SPI_SLEEP_RETENTION_ENABLED 0
#endif

#if SPI_SLEEP_RETENTION_ENABLED
#include <soc/spi_periph.h>
#include <esp_private/sleep_retention.h>
#endif

#if defined(CONFIG_SOC_SERIES_ESP32S2) && defined(CONFIG_ADC_ESP32_DMA) &&                         \
	DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(spi3)) && DT_PROP(DT_NODELABEL(spi3), dma_enabled)
#error "spi3 must not have dma-enabled if ADC_ESP32_DMA is enabled for ESP32-S2"
#endif

#define SPI_DMA_MAX_BUFFER_SIZE 4092

#define SPI_DMA_RX 0
#define SPI_DMA_TX 1

#if CONFIG_PM
static void spi_esp32_pm_policy_state_lock_get(const struct device *dev)
{
	struct spi_esp32_data *data = dev->data;
	unsigned int key = irq_lock();

	if (!data->pm_policy_state_on) {
		data->pm_policy_state_on = true;
		pm_policy_state_all_lock_get();
	}

	irq_unlock(key);
}

static void spi_esp32_pm_policy_state_lock_put(const struct device *dev)
{
	struct spi_esp32_data *data = dev->data;
	unsigned int key = irq_lock();

	if (data->pm_policy_state_on) {
		data->pm_policy_state_on = false;
		pm_policy_state_all_lock_put();
	}
	irq_unlock(key);
}
#endif

static bool spi_esp32_transfer_ongoing(struct spi_esp32_data *data)
{
	return spi_context_tx_on(&data->ctx) || spi_context_rx_on(&data->ctx);
}

static inline void spi_esp32_complete(const struct device *dev,
				      struct spi_esp32_data *data __maybe_unused,
				      spi_dev_t *spi, int status)
{
#ifdef CONFIG_SPI_ESP32_INTERRUPT
	spi_ll_disable_int(spi);
	spi_ll_clear_int_stat(spi);
#endif

	spi_context_cs_control(&data->ctx, false);

#ifdef CONFIG_SPI_ESP32_INTERRUPT
	spi_context_complete(&data->ctx, dev, status);
#endif
}

#ifdef SOC_GDMA_SUPPORTED
static int spi_esp32_gdma_config(const struct device *dev, uint8_t dir, uint8_t *buf, size_t len)
{
	const struct spi_esp32_config *cfg = dev->config;
	struct dma_config dma_cfg = {};
	struct dma_status dma_status = {};
	struct dma_block_config dma_blk = {};
	int err = 0;

	uint8_t dma_channel = (dir == SPI_DMA_RX) ? cfg->dma_rx_ch : cfg->dma_tx_ch;

	if (dma_channel == 0xFF) {
		LOG_ERR("DMA channel is not configured in device tree");
		return -EINVAL;
	}

	err = dma_get_status(cfg->dma_dev, dma_channel, &dma_status);
	if (err) {
		return -EINVAL;
	}

	if (dma_status.busy) {
		LOG_ERR("DMA channel %d is busy", dma_channel);
		return -EBUSY;
	}

	if (dir == SPI_DMA_RX) {
		dma_cfg.channel_direction = PERIPHERAL_TO_MEMORY;
		dma_blk.dest_address = (uint32_t)buf;
	} else {
		dma_cfg.channel_direction = MEMORY_TO_PERIPHERAL;
		dma_blk.source_address = (uint32_t)buf;
	}
	/* dma-host selects the SPI host (0 -> SPI2, 1 -> SPI3), while the GDMA
	 * expects the peripheral trigger id. Derive the trigger from the SPI2
	 * base so the correct peripheral is connected on SoCs where the SPI2
	 * trigger is not zero (e.g. ESP32-C5, ESP32-C61).
	 */
	dma_cfg.dma_slot = SOC_GDMA_TRIG_PERIPH_SPI2 + cfg->dma_host;
	dma_cfg.block_count = 1;
	dma_cfg.head_block = &dma_blk;
	dma_blk.block_size = len;

	err = dma_config(cfg->dma_dev, dma_channel, &dma_cfg);
	if (err) {
		LOG_ERR("Error configuring DMA (%d)", err);
	}

	return err;
}

static int spi_esp32_gdma_start(const struct device *dev, uint8_t dir)
{
	const struct spi_esp32_config *cfg = dev->config;
	uint8_t dma_channel = (dir == SPI_DMA_RX) ? cfg->dma_rx_ch : cfg->dma_tx_ch;

	return dma_start(cfg->dma_dev, dma_channel);
}
#else  /* !SOC_GDMA_SUPPORTED - ESP32/ESP32-S2 integrated SPI-DMA */

/* Setup DMA descriptor for ESP32/ESP32-S2 integrated DMA */
static void spi_esp32_dma_desc_setup(lldesc_t *desc, uint8_t *buf, size_t len, bool is_rx)
{
	memset(desc, 0, sizeof(lldesc_t));
	desc->size = len;
	desc->length = is_rx ? 0 : len;
	desc->buf = buf;
	desc->owner = 1;
	desc->eof = 1;
	desc->sosf = 0;
	desc->offset = 0;
	desc->qe.stqe_next = NULL;
}

static void spi_esp32_dma_rx_start(const struct device *dev, uint8_t *buf, size_t len)
{
	const struct spi_esp32_config *cfg = dev->config;
	struct spi_esp32_data *data = dev->data;
	spi_dev_t *hw = cfg->spi;

	spi_esp32_dma_desc_setup(&data->dma_desc_rx, buf, len, true);

	/* Reset DMA channel, prepare SPI HW for RX, then start DMA */
	spi_dma_ll_rx_reset((spi_dma_dev_t *)hw, 0);
	spi_hal_hw_prepare_rx(hw);
	spi_dma_ll_rx_start((spi_dma_dev_t *)hw, 0, &data->dma_desc_rx);
}

static void spi_esp32_dma_tx_start(const struct device *dev, uint8_t *buf, size_t len)
{
	const struct spi_esp32_config *cfg = dev->config;
	struct spi_esp32_data *data = dev->data;
	spi_dev_t *hw = cfg->spi;

	spi_esp32_dma_desc_setup(&data->dma_desc_tx, buf, len, false);

	/* Reset DMA channel, prepare SPI HW for TX, then start DMA */
	spi_dma_ll_tx_reset((spi_dma_dev_t *)hw, 0);
	spi_hal_hw_prepare_tx(hw);
	spi_dma_ll_tx_start((spi_dma_dev_t *)hw, 0, &data->dma_desc_tx);
}
#endif /* SOC_GDMA_SUPPORTED */

static int IRAM_ATTR spi_esp32_transfer(const struct device *dev)
{
	struct spi_esp32_data *data = dev->data;
	const struct spi_esp32_config *cfg = dev->config;
	struct spi_context *ctx = &data->ctx;
	spi_hal_context_t *hal = &data->hal;
	spi_hal_dev_config_t *hal_dev = &data->dev_config;
	spi_hal_trans_config_t *hal_trans = &data->trans_config;
	size_t chunk_len_bytes = spi_context_max_continuous_chunk(&data->ctx) * data->dfs;
	size_t max_buf_sz =
		cfg->dma_enabled ? SPI_DMA_MAX_BUFFER_SIZE : SOC_SPI_MAXIMUM_BUFFER_SIZE;
	size_t transfer_len_bytes = MIN(chunk_len_bytes, max_buf_sz);
	size_t transfer_len_frames = transfer_len_bytes / data->dfs;
	size_t bit_len = transfer_len_bytes << 3;
	uint8_t *rx_temp = NULL;
	uint8_t *tx_temp = NULL;
	size_t dma_len_tx = MIN(ctx->tx_len * data->dfs, SPI_DMA_MAX_BUFFER_SIZE);
	size_t dma_len_rx = MIN(ctx->rx_len * data->dfs, SPI_DMA_MAX_BUFFER_SIZE);
	bool prepare_data = true;
	int err = 0;

	if (cfg->dma_enabled) {
		/* bit_len needs to be at least one byte long when using DMA */
		bit_len = !bit_len ? 8 : bit_len;
		if (ctx->tx_buf && !esp_ptr_dma_capable((uint32_t *)&ctx->tx_buf[0])) {
			LOG_DBG("Tx buffer not DMA capable");
			tx_temp = k_malloc(dma_len_tx);
			if (!tx_temp) {
				LOG_ERR("Error allocating temp buffer Tx");
				return -ENOMEM;
			}
			memcpy(tx_temp, &ctx->tx_buf[0], dma_len_tx);
		} else if (!ctx->tx_buf && ctx->rx_buf) {
			/* RX-only transfer: allocate zero-filled TX buffer.
			 * In loopback configurations (GPIO matrix or external wire),
			 * SDO must actively output zeros so SDI receives zeros.
			 */
			tx_temp = k_calloc(dma_len_rx, sizeof(uint8_t));
			if (!tx_temp) {
				LOG_ERR("Error allocating zero buffer for RX-only");
				return -ENOMEM;
			}
		}
		if (ctx->rx_buf && (!esp_ptr_dma_capable((uint32_t *)&ctx->rx_buf[0]) ||
				    ((int)&ctx->rx_buf[0] % 4 != 0) || (dma_len_rx % 4 != 0))) {
			/* The rx buffer need to be length of
			 * multiples of 32 bits to avoid heap
			 * corruption.
			 */
			LOG_DBG("Rx buffer not DMA capable");
			rx_temp = k_calloc(((dma_len_rx << 3) + 31) / 8, sizeof(uint8_t));
			if (!rx_temp) {
				LOG_ERR("Error allocating temp buffer Rx");
				err = -ENOMEM;
				goto free;
			}
		}
	}

