zephyrproject-rtos/zephyr/drivers/spi/spi_esp32_spim.c
	/* clean up and prepare SPI hal */
	for (size_t i = 0; i < ARRAY_SIZE(hal->hw->data_buf); ++i) {
#if defined(CONFIG_SOC_SERIES_ESP32C5) || defined(CONFIG_SOC_SERIES_ESP32C61) ||                   \
	defined(CONFIG_SOC_SERIES_ESP32C6) || defined(CONFIG_SOC_SERIES_ESP32H2) ||                \
	defined(CONFIG_SOC_SERIES_ESP32P4) || defined(CONFIG_SOC_SERIES_ESP32S31)
		hal->hw->data_buf[i].val = 0;
#else
		hal->hw->data_buf[i] = 0;
#endif
	}

	hal_trans->send_buffer = tx_temp ? tx_temp : (uint8_t *)ctx->tx_buf;
	hal_trans->rcv_buffer = rx_temp ? rx_temp : ctx->rx_buf;
	hal_trans->tx_bitlen = bit_len;
	hal_trans->rx_bitlen = bit_len;

	/* Use the remaining length, not the buffer count, so trailing
	 * zero-length buffers do not keep CS asserted.
	 */
	size_t tx_remaining =
		(ctx->tx_len > transfer_len_frames) ? (ctx->tx_len - transfer_len_frames) : 0;
	size_t rx_remaining =
		(ctx->rx_len > transfer_len_frames) ? (ctx->rx_len - transfer_len_frames) : 0;

	for (size_t i = 1; i < ctx->tx_count; i++) {
		tx_remaining += ctx->current_tx[i].len;
	}
	for (size_t i = 1; i < ctx->rx_count; i++) {
		rx_remaining += ctx->current_rx[i].len;
	}

	hal_trans->cs_keep_active =
		(UTIL_OR(IS_ENABLED(DT_SPI_CTX_HAS_NO_CS_GPIOS), (ctx->num_cs_gpios == 0)) &&
		 (tx_remaining > 0 || rx_remaining > 0));

	/* configure SPI */
	spi_hal_setup_trans(hal, hal_dev, hal_trans);

#if defined(SOC_GDMA_SUPPORTED)
	if (cfg->dma_enabled && hal_trans->rcv_buffer) {
		sys_cache_data_flush_and_invd_range(hal_trans->rcv_buffer, transfer_len_bytes);
		err = spi_esp32_gdma_config(dev, SPI_DMA_RX, hal_trans->rcv_buffer,
					    transfer_len_bytes);
		if (err) {
			goto free;
		}
	}

	if (cfg->dma_enabled && hal_trans->send_buffer) {
		sys_cache_data_flush_range(hal_trans->send_buffer, transfer_len_bytes);
		err = spi_esp32_gdma_config(dev, SPI_DMA_TX, hal_trans->send_buffer,
					    transfer_len_bytes);
		if (err) {
			goto free;
		}
	}

	if (cfg->dma_enabled && hal_trans->rcv_buffer) {
		spi_ll_dma_rx_fifo_reset(hal->hw);
		spi_ll_infifo_full_clr(hal->hw);
		spi_ll_dma_rx_enable(hal->hw, 1);

		err = spi_esp32_gdma_start(dev, SPI_DMA_RX);
		if (err) {
			goto free;
		}
	}

	if (cfg->dma_enabled && hal_trans->send_buffer) {
		spi_ll_dma_tx_fifo_reset(hal->hw);
		spi_ll_outfifo_empty_clr(hal->hw);
		spi_ll_dma_tx_enable(hal->hw, 1);

		err = spi_esp32_gdma_start(dev, SPI_DMA_TX);
		if (err) {
			goto free;
		}
	}

	if (cfg->dma_enabled) {
		/* Enable SDO/SDI data lines AFTER DMA is configured.
		 * Note: For RX-only DMA, we allocate a zero-filled TX buffer above,
		 * so send_buffer is always set when rcv_buffer is set.
		 */
		spi_hal_enable_data_line(hal->hw, hal_trans->send_buffer != NULL,
					 hal_trans->rcv_buffer != NULL);
	}

	prepare_data = !cfg->dma_enabled;
#else /* !SOC_GDMA_SUPPORTED - ESP32/ESP32-S2 integrated SPI-DMA */
	/*
	 * For ESP32/ESP32-S2, DMA is integrated into the SPI peripheral.
	 * Use spi_dma_ll_* functions to control it.
	 */
	if (cfg->dma_enabled && hal_trans->rcv_buffer) {
		spi_esp32_dma_rx_start(dev, hal_trans->rcv_buffer, transfer_len_bytes);
	}
#if defined(CONFIG_SOC_SERIES_ESP32)
	else if (cfg->dma_enabled && !hal_dev->half_duplex) {
		/* ESP32: RX DMA channel must be running for TX-only full-duplex
		 * transfers, otherwise DMA does not operate correctly.
		 */
		spi_ll_dma_rx_enable(hal->hw, 1);
		spi_dma_ll_rx_start((spi_dma_dev_t *)hal->hw, 0, NULL);
	}
#endif

	if (cfg->dma_enabled && hal_trans->send_buffer) {
		spi_esp32_dma_tx_start(dev, hal_trans->send_buffer, transfer_len_bytes);
	}

	if (cfg->dma_enabled) {
		spi_hal_enable_data_line(hal->hw, hal_trans->send_buffer != NULL,
					 hal_trans->rcv_buffer != NULL);
	}

	prepare_data = !cfg->dma_enabled;
#endif /* SOC_GDMA_SUPPORTED */

	if (prepare_data) {
		spi_hal_push_tx_buffer(hal, hal_trans);
		spi_hal_enable_data_line(hal->hw,
					 (hal_trans->rcv_buffer != NULL) ||
						 (hal_trans->send_buffer != NULL),
					 hal_trans->rcv_buffer != NULL);
	}

	/* send data */
	spi_hal_user_start(hal);
	spi_context_update_tx(&data->ctx, data->dfs, transfer_len_frames);

	while (!spi_hal_usr_is_done(hal)) {
		/* nop */
	}

#if defined(SOC_GDMA_SUPPORTED)
	if (cfg->dma_enabled) {
		if (hal_trans->rcv_buffer) {
			dma_stop(cfg->dma_dev, cfg->dma_rx_ch);
			/* Invalidate cache for the RX buffer so the CPU reads fresh
			 * data the DMA just wrote to memory. No-op when CACHE_MANAGEMENT
			 * is disabled.
			 */
			sys_cache_data_invd_range(hal_trans->rcv_buffer, transfer_len_bytes);
		}
		if (hal_trans->send_buffer) {
			dma_stop(cfg->dma_dev, cfg->dma_tx_ch);
		}
	}
#endif

	if (!cfg->dma_enabled) {
		/* read data */
		spi_hal_fetch_result(hal);
	}

	if (rx_temp) {
		memcpy(&ctx->rx_buf[0], rx_temp, transfer_len_bytes);
	}

	spi_context_update_rx(&data->ctx, data->dfs, transfer_len_frames);

free:
	k_free(tx_temp);
	k_free(rx_temp);

	return err;
}

#ifdef CONFIG_ESP32_SPI_TARGET
/*
 * A controller clocks the whole frame within one chip-select assertion, so the
 * scattered transfer buffers are coalesced into a single FIFO-sized transfer.
 */
static void IRAM_ATTR spi_esp32_target_arm(const struct device *dev)
{
	struct spi_esp32_data *data = dev->data;
	struct spi_context *ctx = &data->ctx;
	spi_slave_hal_context_t *hal = &data->target_hal;
	size_t max_frames = SOC_SPI_MAXIMUM_BUFFER_SIZE / data->dfs;
	size_t off = 0;
	size_t frames = 0;

	data->target_rx_seg_cnt = 0;

	while (frames < max_frames && (spi_context_tx_on(ctx) || spi_context_rx_on(ctx))) {
		size_t chunk = spi_context_max_continuous_chunk(ctx);

		/* Stop gathering rather than clock data that could not be
		 * scattered back: a receive buffer that does not fit in the
		 * segment table would be silently dropped.
		 */
		if (ctx->rx_buf && data->target_rx_seg_cnt >= CONFIG_SPI_ESP32_TARGET_MAX_BUFS) {
			LOG_WRN("Target rx segments exceed %d; truncating transfer",
				CONFIG_SPI_ESP32_TARGET_MAX_BUFS);
			break;
		}

		chunk = MIN(chunk, max_frames - frames);

		if (ctx->tx_buf) {
			memcpy(&data->target_tx_buf[off], ctx->tx_buf, chunk * data->dfs);
		} else {
			memset(&data->target_tx_buf[off], 0, chunk * data->dfs);
		}

		if (ctx->rx_buf) {
			data->target_rx_seg[data->target_rx_seg_cnt].buf = ctx->rx_buf;
			data->target_rx_seg[data->target_rx_seg_cnt].off = off;
			data->target_rx_seg[data->target_rx_seg_cnt].len = chunk * data->dfs;
			data->target_rx_seg_cnt++;
		}

		off += chunk * data->dfs;
		frames += chunk;

		spi_context_update_tx(ctx, data->dfs, chunk);
		spi_context_update_rx(ctx, data->dfs, chunk);
	}

	data->target_frames = frames;

	hal->tx_buffer = data->target_tx_buf;
	hal->rx_buffer = data->target_rx_buf;
	hal->bitlen = (frames * data->dfs) << 3;

#ifdef SOC_GDMA_SUPPORTED
	hal->use_dma = false;
	spi_slave_hal_hw_reset(hal);
	spi_slave_hal_push_tx_buffer(hal);
	/* Reset the TX FIFO after the push so it reloads from the registers. */
	spi_slave_hal_hw_fifo_reset(hal, true, false);
	spi_slave_hal_set_trans_bitlen(hal);
	spi_slave_hal_user_start(hal);
#else
	size_t len = frames * data->dfs;

	hal->use_dma = true;

