zephyrproject-rtos/zephyr/drivers/spi/spi_esp32_spim.c
	spi_esp32_dma_desc_setup(&data->dma_desc_tx, data->target_tx_buf, len, false);
	spi_esp32_dma_desc_setup(&data->dma_desc_rx, data->target_rx_buf, len, true);

	spi_slave_hal_hw_reset(hal);

	spi_dma_ll_tx_reset((spi_dma_dev_t *)hal->hw, 0);
	spi_dma_ll_rx_reset((spi_dma_dev_t *)hal->hw, 0);
	spi_slave_hal_hw_prepare_tx(hal->hw);
	spi_slave_hal_hw_prepare_rx(hal->hw);
	spi_dma_ll_tx_start((spi_dma_dev_t *)hal->hw, 0, &data->dma_desc_tx);
	spi_dma_ll_rx_start((spi_dma_dev_t *)hal->hw, 0, &data->dma_desc_rx);

	spi_slave_hal_set_trans_bitlen(hal);
	spi_slave_hal_enable_data_line(hal);
	spi_slave_hal_user_start(hal);
#endif
}

/* Scatter the received data back into the original spi_context RX buffers. */
static void IRAM_ATTR spi_esp32_target_transfer(const struct device *dev)
{
	struct spi_esp32_data *data = dev->data;
	struct spi_context *ctx = &data->ctx;
	spi_slave_hal_context_t *hal = &data->target_hal;
	size_t rcv_bytes = 0;

	spi_slave_hal_store_result(hal);

	for (size_t i = 0; i < data->target_rx_seg_cnt; i++) {
		memcpy(data->target_rx_seg[i].buf, &data->target_rx_buf[data->target_rx_seg[i].off],
		       data->target_rx_seg[i].len);
		rcv_bytes += data->target_rx_seg[i].len;
	}

	/* Arming counted all armed frames; report only those actually stored. */
	ctx->recv_frames -= data->target_frames;
	ctx->recv_frames += rcv_bytes / data->dfs;
}
#endif /* CONFIG_ESP32_SPI_TARGET */

#ifdef CONFIG_SPI_ESP32_INTERRUPT
static void IRAM_ATTR spi_esp32_isr(void *arg)
{
	const struct device *dev = (const struct device *)arg;
	const struct spi_esp32_config *cfg = dev->config;
	struct spi_esp32_data *data = dev->data;

#ifdef CONFIG_ESP32_SPI_TARGET
	if (data->target_mode) {
		spi_esp32_target_transfer(dev);

		if (spi_esp32_transfer_ongoing(data)) {
			spi_esp32_target_arm(dev);
		} else {
			spi_ll_disable_int(cfg->spi);
			spi_ll_clear_int_stat(cfg->spi);
			spi_context_complete(&data->ctx, dev, 0);
#if CONFIG_PM
			spi_esp32_pm_policy_state_lock_put(dev);
#endif
		}
		return;
	}
#endif /* CONFIG_ESP32_SPI_TARGET */

	do {
		spi_esp32_transfer(dev);
	} while (spi_esp32_transfer_ongoing(data));

	spi_esp32_complete(dev, data, cfg->spi, 0);

#if CONFIG_PM
	spi_esp32_pm_policy_state_lock_put(dev);
#endif
}
#endif

static int spi_esp32_init_dma(const struct device *dev)
{
	const struct spi_esp32_config *cfg = dev->config;
	struct spi_esp32_data *data = dev->data;

#ifdef SOC_GDMA_SUPPORTED
	if (cfg->dma_dev) {
		if (!device_is_ready(cfg->dma_dev)) {
			LOG_ERR("DMA device is not ready");
			return -ENODEV;
		}
	}
	/* For GDMA platforms, DMA is handled by the GDMA driver, not SPI HAL */
	data->hal.dma_enabled = false;
#else
	if (clock_control_on(cfg->clock_dev, (clock_control_subsys_t)cfg->dma_clk_src)) {
		LOG_ERR("Could not enable DMA clock");
		return -EIO;
	}
	data->hal.dma_enabled = true;
#endif /* SOC_GDMA_SUPPORTED */

#ifdef CONFIG_SOC_SERIES_ESP32
	/* Connect SPI and DMA */
	DPORT_SET_PERI_REG_BITS(DPORT_SPI_DMA_CHAN_SEL_REG, 3, cfg->dma_host + 1,
				((cfg->dma_host + 1) * 2));
#endif /* CONFIG_SOC_SERIES_ESP32 */

	return 0;
}

#if SPI_SLEEP_RETENTION_ENABLED
static esp_err_t spi_esp32_create_sleep_retention_cb(void *arg)
{
	const struct device *dev = arg;
	const struct spi_esp32_config *cfg = dev->config;
	unsigned int idx = cfg->dma_host;

	return sleep_retention_entries_create(
		spi_reg_retention_info[idx].entry_array, spi_reg_retention_info[idx].array_size,
		REGDMA_LINK_PRI_GPSPI, spi_reg_retention_info[idx].module_id);
}

static void spi_esp32_sleep_retention_init(const struct device *dev)
{
	const struct spi_esp32_config *cfg = dev->config;
	unsigned int idx = cfg->dma_host;

	sleep_retention_module_t module = spi_reg_retention_info[idx].module_id;
	sleep_retention_module_init_param_t init_param = {
		.cbs = {.create = {.handle = spi_esp32_create_sleep_retention_cb,
				   .arg = (void *)dev}},
		.attribute = SLEEP_RETENTION_MODULE_ATTR_ATTACH,
		.depends = RETENTION_MODULE_BITMAP_INIT(CLOCK_SYSTEM)};

	esp_err_t err = sleep_retention_module_init(module, &init_param);

	if (err == ESP_OK) {
		err = sleep_retention_module_allocate(module);
	}
	if (err == ESP_OK) {
		err = sleep_retention_module_attach(module);
	}
	if (err != ESP_OK) {
		LOG_WRN("SPI sleep retention init failed (%d)", err);
	}
}
#endif /* SPI_SLEEP_RETENTION_ENABLED */

static int spi_esp32_init(const struct device *dev)
{
	int err;
	const struct spi_esp32_config *cfg = dev->config;
	struct spi_esp32_data *data = dev->data;

	if (!cfg->clock_dev) {
		return -EINVAL;
	}

	if (!device_is_ready(cfg->clock_dev)) {
		LOG_ERR("clock control device not ready");
		return -ENODEV;
	}

	/* Enables SPI peripheral */
	err = clock_control_on(cfg->clock_dev, cfg->clock_subsys);
	if (err < 0) {
		LOG_ERR("Error enabling SPI clock");
		return err;
	}

	/* Initialize SPI HAL */
	spi_hal_init(&data->hal, cfg->dma_host + 1);

#ifdef CONFIG_ESP32_SPI_TARGET
	data->target_hal.hw = cfg->spi;
#endif

	/* Enable internal SPI clock - new HAL requires explicit call */
	spi_ll_enable_clock(cfg->dma_host + 1, true);

	spi_ll_set_clk_source(cfg->spi, cfg->clock_source);

	if (cfg->dma_enabled) {
		err = spi_esp32_init_dma(dev);
		if (err) {
			LOG_ERR("Error initializing SPI DMA");
			return err;
		}
	}

#ifdef CONFIG_SPI_ESP32_INTERRUPT
	spi_ll_disable_int(cfg->spi);
	spi_ll_clear_int_stat(cfg->spi);

	err = esp_intr_alloc(cfg->irq_source,
			ESP_PRIO_TO_FLAGS(cfg->irq_priority) |
			ESP_INT_FLAGS_CHECK(cfg->irq_flags) | ESP_INTR_FLAG_IRAM,
			(intr_handler_t)spi_esp32_isr,
			(void *)dev,
			NULL);

	if (err != 0) {
		LOG_ERR("could not allocate interrupt (err %d)", err);
		return err;
	}
#endif

	err = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (err < 0) {
		LOG_ERR("Failed to configure SPI pins");
		return err;
	}

	err = spi_context_cs_configure_all(&data->ctx);
	if (err < 0) {
		return err;
	}

	err = esp_clk_tree_src_get_freq_hz(
		cfg->clock_source, ESP_CLK_TREE_SRC_FREQ_PRECISION_APPROX, &data->clock_source_hz);
	if (err) {
		LOG_ERR("Could not get clock source frequency (%d)", err);
		return err;
	}

	spi_context_unlock_unconditionally(&data->ctx);

