zephyrproject-rtos/zephyr/drivers/spi/spi_esp32_spim.c
#if SPI_SLEEP_RETENTION_ENABLED
	spi_esp32_sleep_retention_init(dev);
#endif

	return 0;
}

static inline uint8_t spi_esp32_get_line_mode(spi_operation_t operation)
{
	if (IS_ENABLED(CONFIG_SPI_EXTENDED_MODES)) {
		switch (operation & SPI_LINES_MASK) {
		case SPI_LINES_SINGLE:
			return 1;
		case SPI_LINES_DUAL:
			return 2;
		case SPI_LINES_OCTAL:
			return 8;
		case SPI_LINES_QUAD:
			return 4;
		default:
			break;
		}
	}

	return 1;
}

#ifdef SPI_LL_SRC_PRE_DIV_MAX

/* Peripheral hardware limitation for the clock rate entering the peripheral */
#define SPI_ESP32_PERIPH_SRC_FREQ_MAX (80 * 1000 * 1000)

static uint32_t spi_esp32_find_clock_src_pre_div(uint32_t src_freq, uint32_t target_freq)
{
	/* Pre-division must be even and at least 2 */
	uint32_t min_div = (DIV_ROUND_UP(src_freq, SPI_ESP32_PERIPH_SRC_FREQ_MAX) + 1) & (~0x01UL);

	min_div = min_div < 2 ? 2 : min_div;

	if (target_freq == 0) {
		return min_div;
	}

	uint32_t total_div = src_freq / target_freq;

	for (uint32_t pre_div = min_div; pre_div <= MIN(total_div, SPI_LL_SRC_PRE_DIV_MAX);
	     pre_div += 2) {
		if ((total_div % pre_div) || (total_div / pre_div) > SPI_LL_PERIPH_CLK_DIV_MAX) {
			continue;
		}
		return pre_div;
	}
	return min_div;
}

#endif /* SPI_LL_SRC_PRE_DIV_MAX */

static int IRAM_ATTR spi_esp32_configure(const struct device *dev,
					 const struct spi_config *spi_cfg)
{
	const struct spi_esp32_config *cfg = dev->config;
	struct spi_esp32_data *data = dev->data;
	struct spi_context *ctx = &data->ctx;
	spi_hal_context_t *hal = &data->hal;
	spi_hal_dev_config_t *hal_dev = &data->dev_config;

	if (spi_context_configured(ctx, spi_cfg)) {
		return 0;
	}

	ctx->config = spi_cfg;

	if (spi_cfg->operation & SPI_HALF_DUPLEX) {
		LOG_ERR("Half-duplex not supported");
		return -ENOTSUP;
	}

	if (spi_cfg->operation & SPI_OP_MODE_PERIPHERAL) {
#ifdef CONFIG_ESP32_SPI_TARGET
		spi_slave_hal_context_t *shal = &data->target_hal;

		shal->mode = 0;
		if (SPI_MODE_GET(spi_cfg->operation) & SPI_MODE_CPHA) {
			shal->mode = BIT(0);
		}
		if (SPI_MODE_GET(spi_cfg->operation) & SPI_MODE_CPOL) {
			shal->mode |= BIT(1);
		}
		shal->tx_lsbfirst = (spi_cfg->operation & SPI_TRANSFER_LSB) ? 1 : 0;
		shal->rx_lsbfirst = (spi_cfg->operation & SPI_TRANSFER_LSB) ? 1 : 0;
#ifdef SOC_GDMA_SUPPORTED
		shal->use_dma = false;
#else
		/* CPU/FIFO peripheral mode drops the final received byte on these
		 * socs, so the target is driven via the integrated SPI-DMA.
		 */
		if (!cfg->dma_enabled) {
			LOG_ERR("Target mode on this soc requires dma-enabled");
			return -EINVAL;
		}
		shal->use_dma = true;
		shal->dmadesc_tx = (spi_dma_desc_t *)&data->dma_desc_tx;
		shal->dmadesc_rx = (spi_dma_desc_t *)&data->dma_desc_rx;
		shal->dmadesc_n = 1;
#endif

		/* spi_slave_hal_init force-enables a trans-done interrupt; mask
		 * it until the device is armed in transceive().
		 */
		unsigned int key = irq_lock();

		data->target_mode = true;
		spi_slave_hal_init(shal, &(spi_slave_hal_config_t){.host_id = cfg->dma_host + 1});
		spi_slave_hal_setup_device(shal);
		spi_ll_disable_int(cfg->spi);
		spi_ll_clear_int_stat(cfg->spi);

		irq_unlock(key);
		return 0;
#else
		LOG_ERR("Target mode requires CONFIG_ESP32_SPI_TARGET");
		return -ENOTSUP;
#endif /* CONFIG_ESP32_SPI_TARGET */
	}

	if (spi_cfg->operation & SPI_MODE_LOOP) {
		LOG_ERR("Loopback mode is not supported");
		return -ENOTSUP;
	}

	/*
	 * CS handling:
	 * - When using GPIO CS (cs-gpios property), the spi_context manages
	 *   chip select via GPIO. Hardware CS must be disabled by setting
	 *   cs_pin_id outside valid range (0-2). Any value > 2 disables all
	 *   hardware CS lines per documentation.
	 * - When using hardware CS (directly via pinctrl), the peripheral
	 *   number maps to the hardware CS pin (CS0, CS1, CS2).
	 */
	if (spi_cs_is_gpio(spi_cfg)) {
		hal_dev->cs_pin_id = -1;
	} else {
		hal_dev->cs_pin_id = ctx->config->peripheral;
	}

	uint32_t clk_src_hz = data->clock_source_hz;

#ifdef SPI_LL_SRC_PRE_DIV_MAX
	uint32_t pre_div = spi_esp32_find_clock_src_pre_div(clk_src_hz, spi_cfg->frequency);

	/* The timing configuration below is computed from the rate that
	 * enters the peripheral, after the pre-divider
	 */
	clk_src_hz /= pre_div;
#endif

	/* input parameters to calculate timing configuration */
	spi_hal_timing_param_t timing_param = {
		.half_duplex = hal_dev->half_duplex,
		.no_compensate = hal_dev->no_compensate,
		.expected_freq = spi_cfg->frequency,
		.duty_cycle = cfg->duty_cycle == 0 ? 128 : cfg->duty_cycle,
		.input_delay_ns = cfg->input_delay_ns,
		.use_gpio = !cfg->use_iomux,
		.clk_src_hz = clk_src_hz,
	};

	spi_hal_cal_clock_conf(&timing_param, &hal_dev->timing_conf);

#ifdef SPI_LL_SRC_PRE_DIV_MAX
	hal_dev->timing_conf.source_pre_div = pre_div;
	hal_dev->timing_conf.source_real_freq = clk_src_hz;
#endif

	data->trans_config.dummy_bits = hal_dev->timing_conf.timing_dummy;

	hal_dev->tx_lsbfirst = spi_cfg->operation & SPI_TRANSFER_LSB ? 1 : 0;
	hal_dev->rx_lsbfirst = spi_cfg->operation & SPI_TRANSFER_LSB ? 1 : 0;

	data->trans_config.line_mode.data_lines = spi_esp32_get_line_mode(spi_cfg->operation);

	/* multiline for command and address not supported */
	data->trans_config.line_mode.addr_lines = 1;
	data->trans_config.line_mode.cmd_lines = 1;

	/* SPI mode */
	hal_dev->mode = 0;
	if (SPI_MODE_GET(spi_cfg->operation) & SPI_MODE_CPHA) {
		hal_dev->mode = BIT(0);
	}
	if (SPI_MODE_GET(spi_cfg->operation) & SPI_MODE_CPOL) {
		hal_dev->mode |= BIT(1);
	}

	/* Chip select setup and hold times */
	/* GPIO CS have their own delay parameter*/
	if (!spi_cs_is_gpio(spi_cfg)) {
		hal_dev->cs_hold = cfg->cs_hold;
		hal_dev->cs_setup = cfg->cs_setup;
	}

	spi_hal_setup_device(hal, hal_dev);

#ifdef SPI_LL_SRC_PRE_DIV_MAX
	/* The pre-divider fields share a clkrst register with the other
	 * SPI host, so the read-modify-write must not be preempted
	 */
	unsigned int key = irq_lock();

	/* Program the pre-divider; hs_div times mst_div is the total pre-division */
	spi_ll_clk_source_pre_div(hal->hw, pre_div / 2, 2);

	irq_unlock(key);
#endif

	/* Workaround to handle default state of SDI and SDO lines */
#ifndef CONFIG_SOC_SERIES_ESP32
	spi_dev_t *hw = hal->hw;

	if (cfg->line_idle_low) {
		hw->ctrl.d_pol = 0;
		hw->ctrl.q_pol = 0;
	} else {
		hw->ctrl.d_pol = 1;
		hw->ctrl.q_pol = 1;
	}
#endif

